Revit 2026 API

# FileImportingEventArgs Properties

---

The FileImportingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. (Inherited from RevitAPIPreDocEventArgs) |
|  | Format | Identifies the import format, e.g. DWG or image. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Path | Path of the source file which is about to be imported. |

#### Reference

FileImportingEventArgs Class

Autodesk.Revit.DB.Events Namespace